{"sections":{"banner":{"type":"banner","disabled":true,"settings":{"image_darken":false,"subtitle":"Subheading","width":"wide","banner_height":"medium","padding_top":0,"padding_bottom":0,"css_class":"","custom_css":""}},"page":{"type":"page-content__main","settings":{"show_heading":true,"heading_alignment":"left","width":"standard","padding_top":40,"padding_bottom":0,"css_class":"","custom_css":""}},"main":{"type":"index__faq","blocks":{"16306825309648acac-0":{"type":"heading","settings":{"title":"SHIPPING"}},"16306825309648acac-1":{"type":"content","settings":{"title":"UK DELIVERY TIMES & CHARGES","answer":"<p>For orders placed during our cyber period we will only be offering Standard UK Delivery.<\/p><p>Please allow up to 7 days for standard orders to be shipped from our warehouse.<\/p><p><\/p><p>Standard UK Delivery £3 *. Standard delivery will take 3-10 working days for all UK mainland postcodes.<\/p><p>Express UK Delivery £6 - 1-2 Days delivery if ordered before 3pm Mon-Fri. All orders placed after 3pm on Fridays will be dispatched on Monday excluding bank holidays.<\/p>"}},"16306825309648acac-2":{"type":"content","settings":{"title":"INTERNATIONAL DELIVERY TIMES & CHARGES","answer":"<p>Due to logistic backlogs throughout the cyber period we will only be shipping to a select few destinations for a limited period.<br\/>These destinations are:<br\/>UK<\/p><p>Australia<\/p><p>Canada<\/p><p>Dubai<\/p><p>Ireland<\/p><p>USA<\/p><p><\/p><p>Please select shopping from your desired country of delivery at the top of the website for best delivery prices and delivery times at checkout.<\/p><p><br\/>We offer express shipping via DHL which can take 1-3 days.<\/p><p><\/p>"}},"16306825309648acac-3":{"type":"content","settings":{"title":"CUSTOMS CHARGES","answer":"<p>International orders may be subject to customs or import duties once it reaches the destination country. Vesper 247 is not liable for payment of these charges and they must be paid by the person receiving the parcel. Unfortunately, as these charges vary from country to country, we cannot advise you at checkout what these charges may be. We advise you to contact your local customs office before placing your order for an estimate.<\/p>"}},"16306825309648acac-4":{"type":"heading","settings":{"title":"RETURNS"}},"16306825309648acac-5":{"type":"content","settings":{"title":"RETURNS POLICY","answer":"<p>Returns are currently taking up to 14 working days to be processed once receved into our warehouse.<\/p><p><\/p><p>If you are not completely satisfied with your purchase, simply return the item or items to us in an unused and saleable condition within 28 days of receipt. We will issue a refund on receipt of return, which can take up to 10 working days to process through the warehouse.<\/p><p>We will not refund your original shipping price unless your item was faulty or the wrong item was delivered.<br\/><\/p><p>Please ensure that you include a returns slip with your name and order number in the parcel. Failure to do so may result in the refund process being delayed. Items will be inspected upon return, and will be returned to the sender if they are not in their original saleable condition, along with the original tags and packaging. <\/p><p>We regret that any garments returned without the “Non Returnable if removed” tag cannot be refunded.<\/p><p><\/p><p>Please keep hold of your proof of postage until your refund had been processed. We regret that if you do not have proof of postage, our team will be unable to issue a refund.<\/p><p><\/p><p>For customers buying Christmas gifts we offer an extended returns policy. <\/p><p>Any Christmas gifts bought between 1st December 2022 and 24th December 2022 can be returned up until, and including the 31st January 2023 or within the standard 28 days after purchase, whichever is later. <\/p>"}},"16306825309648acac-6":{"type":"content","settings":{"title":"HOW TO RETURN","answer":"<p>For UK customers, a processing fee of £1.50 will be deducted from your total refund for orders placed after 06\/11\/2022.<\/p><p>Log into your account to start a return or you can click this link to visit our returns portal:<\/p><p><a href=\"https:\/\/vesper247.com\/apps\/return_prime\" target=\"_blank\" title=\"RETURNS PORTAL\">RETURNS PORTAL<\/a> <\/p><p>Please include your returns slip with your name and order number within the parcel and return via Royal Mail. If you are based outside of the UK you will need to cover the postage cost and we do advise you send your return using a tracked service. If you are based in the UK and do not wish to use our postage services you must cover the costs of the returns.<\/p><p>Vesper 247 will not accept responsibility for any parcels not received if sent untracked. Please retain your proof of postage. Once we have received your return we will send you an email confirmation. <\/p>"}},"16306825309648acac-7":{"type":"content","settings":{"title":"FAULTY GARMENT","answer":"<p>Goods are classified as faulty if you received them in a damaged condition, or if a manufacturing fault occurs within six months of purchase. <\/p><p>Please follow the care labels to ensure that your garment stays in its best condition, as we will not refund or exchange items that are damaged as a result of wear and tear or failure to correctly follow care instructions.<\/p><p>Where possible, we will offer to repair faulty items. If you would like to exchange your item, please be aware that we can only replace it for the same product in the same size, subject to availability. You will receive a full refund only if the item cannot be repaired or replaced.<\/p><p>If you have received a faulty item, please contact our customer services team immediately so we can resolve this as quickly as possible: contact@vesper247.com. The customer service team hope to respond to you as soon as possible. The team are available Monday to Friday from 9am-5:30pm.<\/p>"}},"16306825309648acac-8":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/gracie_navy_front.jpg"}},"a0e8be56-fdaa-4f62-a873-6bf8018ff053":{"type":"heading","settings":{"title":"CHRISTMAS DELIVERY"}},"6d701cf4-792c-4885-af13-679a459b112a":{"type":"content","settings":{"title":"CHRISTMAS DELIVERY TIMES","answer":"<p>Last order dates for delivery before Christmas. Orders must be placed before 3pm.<\/p><p><\/p><p>Standard UK Delivery- 15th December 2022<\/p><p><\/p><p>Express UK Delivery- 20th December 2022<\/p><p><\/p><p>International Express Delivery- 19th December 2022<\/p>"}}},"block_order":["16306825309648acac-0","16306825309648acac-1","16306825309648acac-2","16306825309648acac-3","16306825309648acac-4","16306825309648acac-5","16306825309648acac-6","16306825309648acac-7","16306825309648acac-8","a0e8be56-fdaa-4f62-a873-6bf8018ff053","6d701cf4-792c-4885-af13-679a459b112a"],"settings":{"title":"","width":"standard","padding_top":0,"padding_bottom":80,"animation":"none","css_class":"","custom_css":""}}},"order":["banner","page","main"]}